Autodesk.Revit.Attributes.JournalingAttribute.Mode
Journaling mode.
Since: 2011

Autodesk.Revit.Attributes.JournalingAttribute.#ctor(Autodesk.Revit.Attributes.JournalingMode)
Constructs a new JournalingAttribute.
Since: 2011

Autodesk.Revit.Attributes.JournalingAttribute
The custom journaling attribute to control the journaling behavior of the external command.
Since: 2011